#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
metabase_database.postgres: Refreshing state... [name=MFB PostgreSQL Analytics]
metabase_database.tenant_postgres["ma"]: Refreshing state... [name=MFB PostgreSQL Massachusetts]
metabase_database.tenant_postgres["cesn"]: Refreshing state... [name=MFB PostgreSQL CESN]
metabase_database.tenant_postgres["nc"]: Refreshing state... [name=MFB PostgreSQL North Carolina]
metabase_database.tenant_postgres["co_tax_calculator"]: Refreshing state... [name=MFB PostgreSQL CO Tax Calculator]
metabase_database.tenant_postgres["co"]: Refreshing state... [name=MFB PostgreSQL Colorado]
metabase_database.tenant_postgres["il"]: Refreshing state... [name=MFB PostgreSQL Illinois]
metabase_database.tenant_postgres["tx"]: Refreshing state... [name=MFB PostgreSQL Texas]
time_sleep.wait_for_database_sync: Refreshing state... [id=2026-03-13T16:31:13Z]
data.metabase_table.tenant_screen_summary_tables["ma"]: Reading...
data.metabase_table.tenant_screen_summary_tables["nc"]: Reading...
data.metabase_table.tenant_screen_summary_tables["co_tax_calculator"]: Reading...
data.metabase_table.tenant_screen_summary_tables["il"]: Reading...
metabase_collection.global: Refreshing state... [id=34]
data.metabase_table.tenant_screen_summary_tables["cesn"]: Reading...
data.metabase_table.tenant_screen_summary_tables["tx"]: Reading...
data.metabase_table.tenant_screen_summary_tables["co"]: Reading...
data.metabase_table.screen_summary_table: Reading...
metabase_collection.tenant_collection_nc: Refreshing state... [id=35]
metabase_collection.tenant_collection_co: Refreshing state... [id=36]
metabase_collection.tenant_collection_tx: Refreshing state... [id=37]
metabase_collection.tenant_collection_il: Refreshing state... [id=38]
metabase_collection.tenant_collection_ma: Refreshing state... [id=39]
metabase_collection.tenant_collection_cesn: Refreshing state... [id=40]
metabase_collection.tenant_collection_co_tax_calculator: Refreshing state... [id=41]
data.metabase_table.tenant_screen_summary_tables["nc"]: Read complete after 1s [name=mart_screener_data]
data.metabase_table.tenant_screen_summary_tables["ma"]: Read complete after 1s [name=mart_screener_data]
data.metabase_table.tenant_screen_summary_tables["co_tax_calculator"]: Read complete after 1s [name=mart_screener_data]
data.metabase_table.tenant_screen_summary_tables["tx"]: Read complete after 1s [name=mart_screener_data]
data.metabase_table.screen_summary_table: Read complete after 1s [name=mart_screener_data]
metabase_card.screen_count: Refreshing state...
data.metabase_table.tenant_screen_summary_tables["il"]: Read complete after 1s [name=mart_screener_data]
data.metabase_table.tenant_screen_summary_tables["co"]: Read complete after 1s [name=mart_screener_data]
data.metabase_table.tenant_screen_summary_tables["cesn"]: Read complete after 1s [name=mart_screener_data]
metabase_card.tenant_screen_count["il"]: Refreshing state...
metabase_card.tenant_screen_count["tx"]: Refreshing state...
metabase_card.tenant_screen_count["ma"]: Refreshing state...
metabase_card.tenant_screen_count["cesn"]: Refreshing state...
metabase_card.tenant_screen_count["nc"]: Refreshing state...
metabase_card.tenant_screen_count["co_tax_calculator"]: Refreshing state...
metabase_card.tenant_screen_count["co"]: Refreshing state...
metabase_dashboard.analytics: Refreshing state... [name=MFB Analytics Dashboard]
metabase_dashboard.tenant_analytics["ma"]: Refreshing state... [name=Massachusetts Dashboard]
metabase_dashboard.tenant_analytics["co"]: Refreshing state... [name=Colorado Dashboard]
metabase_dashboard.tenant_analytics["tx"]: Refreshing state... [name=Texas Dashboard]
metabase_dashboard.tenant_analytics["co_tax_calculator"]: Refreshing state... [name=CO Tax Calculator Dashboard]
metabase_dashboard.tenant_analytics["il"]: Refreshing state... [name=Illinois Dashboard]
metabase_dashboard.tenant_analytics["cesn"]: Refreshing state... [name=CESN Dashboard]
metabase_dashboard.tenant_analytics["nc"]: Refreshing state... [name=North Carolina Dashboard]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # metabase_collection_graph.graph will be created
  + resource "metabase_collection_graph" "graph" {
      + ignored_groups = [
          + 2,
        ]
      + permissions    = [
          + {
              + collection = "34"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "35"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "35"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "36"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "36"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "37"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "37"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "38"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "38"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "39"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "39"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "40"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "40"
              + group      = (known after apply)
              + permission = "write"
            },
          + {
              + collection = "41"
              + group      = (known after apply)
              + permission = "read"
            },
          + {
              + collection = "41"
              + group      = (known after apply)
              + permission = "write"
            },
        ]
      + revision       = (known after apply)
    }

  # metabase_permissions_group.global will be created
  + resource "metabase_permissions_group" "global" {
      + id   = (known after apply)
      + name = "Global"
    }

  # metabase_permissions_group.tenant["cesn"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "CESN"
    }

  # metabase_permissions_group.tenant["co"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "Colorado"
    }

  # metabase_permissions_group.tenant["co_tax_calculator"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "CO Tax Calculator"
    }

  # metabase_permissions_group.tenant["il"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "Illinois"
    }

  # metabase_permissions_group.tenant["ma"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "Massachusetts"
    }

  # metabase_permissions_group.tenant["nc"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "North Carolina"
    }

  # metabase_permissions_group.tenant["tx"] will be created
  + resource "metabase_permissions_group" "tenant" {
      + id   = (known after apply)
      + name = "Texas"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + global_group_id       = (known after apply)
  + tenant_group_ids      = {
      + cesn              = (known after apply)
      + co                = (known after apply)
      + co_tax_calculator = (known after apply)
      + il                = (known after apply)
      + ma                = (known after apply)
      + nc                = (known after apply)
      + tx                = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @IrynaKolh, Action: `pull_request`, Environment: `staging`*